---
kind: property
id: P:Autodesk.Revit.DB.View.RightDirection
zh: 视图
source: html/31c1d1ff-845b-0037-bf69-0735244f51b0.htm
---
# Autodesk.Revit.DB.View.RightDirection Property

**中文**: 视图

The direction towards the right side of the screen.

## Syntax (C#)
```csharp
public XYZ RightDirection { get; }
```